# FieldBuilder Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FieldBuilder Constructor
FieldBuilder Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FieldBuilder(FieldBuilder) | Constructs a new copy of the input ESFieldBuilder object. |
| FieldBuilder(Field, SchemaBuilder) | Constructs a new FieldBuilder using the field and associated SchemaBuilder object. |

# See Also
FieldBuilder Class
FieldBuilder Members
Autodesk.Revit.DB.ExtensibleStorage Namespace